In [1]:
import pandas as pd

In [3]:
data={'Students':['Amit','Anam','Chi','Sam','Ravi','Jai'],
        'Marks':[85,None,65,75,None,55]
        }

In [4]:
df=pd.DataFrame(data)
print('Original data')
df

  Students  Marks
0     Amit   85.0
1     Anam    NaN
2      Chi   65.0
3      Sam   75.0
4     Ravi    NaN
5      Jai   55.0

In [5]:
print('Missing Data')
print('Number of Missing values are: ',df.isnull().sum())

Missing Data
Number of Missing values are:  Students    0
Marks       2
dtype: int64

In [6]:
average_marks=df['Marks'].mean()
print(average_marks)

70.0

In [7]:
df.fillna(average_marks,inplace=True)

In [8]:
print('After fillna() call')
df

After fillna() call

  Students  Marks
0     Amit   85.0
1     Anam   70.0
2      Chi   65.0
3      Sam   75.0
4     Ravi   70.0
5      Jai   55.0

# How we will use in our project

In [10]:
student_data={'Students':['Amit','Anam','Chi','Sam','Ravi','Jai'],
        'Marks':[85,None,65,75,None,55]
        }

df=pd.DataFrame(student_data)
print('Original data')
df

Original data

  Students  Marks
0     Amit   85.0
1     Anam    NaN
2      Chi   65.0
3      Sam   75.0
4     Ravi    NaN
5      Jai   55.0

In [11]:
df.fillna(df['Marks'].mean(),inplace=True)
print('After Cleaning Data')
df

After Cleaning Data

  Students  Marks
0     Amit   85.0
1     Anam   70.0
2      Chi   65.0
3      Sam   75.0
4     Ravi   70.0
5      Jai   55.0

# dropna() example

In [12]:
student_data={'Students':['Amit','Anam','Chi','Sam','Ravi','Jai'],
        'Marks':[85,None,65,75,None,55]
        }
df=pd.DataFrame(student_data)
print('Original data')
df

Original data

  Students  Marks
0     Amit   85.0
1     Anam    NaN
2      Chi   65.0
3      Sam   75.0
4     Ravi    NaN
5      Jai   55.0

In [13]:
df=df.dropna(subset=['Marks'])

In [14]:
print('Dataset after dropna()')
df

Dataset after dropna()

  Students  Marks
0     Amit   85.0
2      Chi   65.0
3      Sam   75.0
5      Jai   55.0

In [15]:
emp_data={'Name':['Sam','Ali','Chang','Xi','Vis','Suhail'],
        'Age':[35,None,25,20,24,None],
          'Salary':[50000,40000,50000,40000,None,None]
         }
df=pd.DataFrame(emp_data)
print('Original Data')
df

Original Data

     Name   Age   Salary
0     Sam  35.0  50000.0
1     Ali   NaN  40000.0
2   Chang  25.0  50000.0
3      Xi  20.0  40000.0
4     Vis  24.0      NaN
5  Suhail   NaN      NaN

In [16]:
print(df.isnull().sum())

Name      0
Age       2
Salary    2
dtype: int64

In [17]:
df_drop=df.dropna()
df_drop

    Name   Age   Salary
0    Sam  35.0  50000.0
2  Chang  25.0  50000.0
3     Xi  20.0  40000.0

In [21]:
df_drop_salary=df.dropna(subset=['Salary'])

In [22]:
df_drop_salary

    Name   Age   Salary
0    Sam  35.0  50000.0
1    Ali   NaN  40000.0
2  Chang  25.0  50000.0
3     Xi  20.0  40000.0

In [23]:

#fillna example
print(df)

    Name   Age   Salary
0    Sam  35.0  50000.0
1    Ali   NaN  40000.0
2  Chang  25.0  50000.0
3     Xi  20.0  40000.0

In [24]:

emp_data={
    "Name":['Sam','Ali','Chang','Xi','Viz','Suhail'],
    "Age":[35,None,25,20,24,None],
    "Salary":[50000,30000,20000,40000,None,None],
    }
df=pd.DataFrame(emp_data)
print('Original Data')
df

Original Data

     Name   Age   Salary
0     Sam  35.0  50000.0
1     Ali   NaN  30000.0
2   Chang  25.0  20000.0
3      Xi  20.0  40000.0
4     Viz  24.0      NaN
5  Suhail   NaN      NaN

In [25]:
df.fillna({'Age':df['Age'].mean(),'Salary':df['Salary'].mean()}, inplace=True)

In [26]:
df

     Name   Age   Salary
0     Sam  35.0  50000.0
1     Ali  26.0  30000.0
2   Chang  25.0  20000.0
3      Xi  20.0  40000.0
4     Viz  24.0  35000.0
5  Suhail  26.0  35000.0

In [27]:
emp_data={
    "Name":['Sam','Ali','Chang','Xi','Viz','Suhail'],
    "Age":[35,None,25,20,24,None],
    "Salary":[50000,30000,20000,40000,None,None],
    }
df=pd.DataFrame(emp_data)
df.fillna({'Age':df['Age'].mean(),'Salary':df['Salary'].mean()}, inplace=True)
df

     Name   Age   Salary
0     Sam  35.0  50000.0
1     Ali  26.0  30000.0
2   Chang  25.0  20000.0
3      Xi  20.0  40000.0
4     Viz  24.0  35000.0
5  Suhail  26.0  35000.0

In [28]:
# Download students_performance_dirty.csv
#find out number of missing data
#drop rows where gender is missing
#fill study_hours with average study_hours

In [41]:
df=pd.read_csv('students_performance_dirty.csv')
df.head(5)

   gender  study_hours  attendance_pct  math_score  reading_score  final_score
0    male          1.7            83.6        62.0           91.0         38.9
1     NaN          2.6            91.2        82.0           60.0         37.5
2  female          2.9            97.5        69.0           57.0         35.0
3  female          4.8            85.7        78.0           62.0         36.5
4    male          3.9           -10.0        64.0           95.0         30.9

In [42]:
print(df.isnull().sum())

gender            8
study_hours       8
attendance_pct    0
math_score        0
reading_score     0
final_score       0
dtype: int64

In [43]:
df_deleted_gender=df.dropna(subset=['gender'])

In [44]:
df_deleted_gender.fillna({'study_hours':df['study_hours'].mean()}, inplace=True)

C:\Users\pc\AppData\Local\Temp\ipykernel_1396\1311364435.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_deleted_gender.fillna({'study_hours':df['study_hours'].mean()}, inplace=True)

In [45]:
print('Number of Missing values are: ',df_deleted_gender.isnull().sum())

Number of Missing values are:  gender            0
study_hours       0
attendance_pct    0
math_score        0
reading_score     0
final_score       0
dtype: int64